nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso55s69/usb_examples/usb_host_video_camera/freertos/cm33_core0/pin_mux.c
    if (Chip_GetVersion()==1)
    {
        const uint32_t port0_pin9_config = (/* Pin is configured as SD0_POW_EN */
                                            IOCON_PIO_FUNC2 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is closed (enabled) */
                                            IOCON_PIO_ASW_EN);
        /* PORT0 PIN9 (coords: 55) is configured as SD0_POW_EN */
        IOCON_PinMuxSet(IOCON, 0U, 9U, port0_pin9_config);
    }
    else
    {
        const uint32_t port0_pin9_config = (/* Pin is configured as SD0_POW_EN */
                                            IOCON_PIO_FUNC2 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is closed (enabled), only for A0 version */
                                            IOCON_PIO_ASW_DIS_EN);
        /* PORT0 PIN9 (coords: 55) is configured as SD0_POW_EN */
        IOCON_PinMuxSet(IOCON, 0U, 9U, port0_pin9_config);
    }

    if (Chip_GetVersion()==1)
    {
        const uint32_t port1_pin0_config = (/* Pin is configured as SD0_D3 */
                                            IOCON_PIO_FUNC2 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is closed (enabled) */
                                            IOCON_PIO_ASW_EN);
        /* PORT1 PIN0 (coords: 11) is configured as SD0_D3 */
        IOCON_PinMuxSet(IOCON, 1U, 0U, port1_pin0_config);
    }
    else
    {
        const uint32_t port1_pin0_config = (/* Pin is configured as SD0_D3 */
                                            IOCON_PIO_FUNC2 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is closed (enabled), only for A0 version */
                                            IOCON_PIO_ASW_DIS_EN);
        /* PORT1 PIN0 (coords: 11) is configured as SD0_D3 */
        IOCON_PinMuxSet(IOCON, 1U, 0U, port1_pin0_config);
    }

    const uint32_t port1_pin12_config = (/* Pin is configured as USB0_PORTPWRN */
                                         IOCON_PIO_FUNC4 |
                                         /* Selects pull-up function */
                                         IOCON_PIO_MODE_PULLUP |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN12 (coords: 67) is configured as USB0_PORTPWRN */
    IOCON_PinMuxSet(IOCON, 1U, 12U, port1_pin12_config);

    const uint32_t port1_pin29_config = (/* Pin is configured as USB1_PORTPWRN */
                                         IOCON_PIO_FUNC4 |
                                         /* Selects pull-up function */
                                         IOCON_PIO_MODE_PULLUP |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN29 (coords: 80) is configured as USB1_PORTPWRN */
    IOCON_PinMuxSet(IOCON, 1U, 29U, port1_pin29_config);

    const uint32_t port1_pin30_config = (/* Pin is configured as USB1_OVERCURRENTN */
                                         IOCON_PIO_FUNC4 |
                                         /* Selects pull-up function */
                                         IOCON_PIO_MODE_PULLUP |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN30 (coords: 65) is configured as USB1_OVERCURRENTN */
    IOCON_PinMuxSet(IOCON, 1U, 30U, port1_pin30_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/